Revit 2027 API
BuiltInFailures.FamilyFailures.CannotSplitElement Property
 Can't split structural element
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotSplitElement { get; }
Public Shared ReadOnly Property CannotSplitElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotSplitElement {
	FailureDefinitionId^ get ();
}
static member CannotSplitElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace